nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Preprocess, [250]] # 0
  - [-1, 1, Conv, [64, 3, 2]] # 1
  - [-1, 1, Conv, [128, 3, 2]] # 2
  - [-1, 3, C2f, [128, True]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4
  - [-1, 6, C2f, [256, True]] # 5 P3
  - [-1, 1, Conv, [512, 3, 2]] # 6 
  - [-1, 6, C2f, [512, True]] # 7 P4
  - [-1, 1, Conv, [1024, 3, 2]] # 8
  - [-1, 3, C2f, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]] # 10 p5

motionbackbone:
  - [0, 1, Diff, [2]] # 11
  - [-1, 1, Conv, [64, 3, 2]] # 12
  - [-1, 1, Conv, [128, 3, 2]] # 13
  - [-1, 1, C2f, [128, True]] # 14
  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [-1, 2, C2f, [256, True]] # 16 P3
  - [-1, 1, Conv, [512, 3, 2]] # 17
  - [-1, 3, C2f, [512, True]] # 18 P4
  - [-1, 1, Conv, [1024, 3, 2]] # 19
  - [-1, 1, C2f, [1024, True]] # 20
  - [-1, 1, SPPF, [1024, 5]] # 21 P5

# YOLOv8.0n head
head:
  - [10, 1, nn.Upsample, [None, 2, "nearest"]] # 22
  - [[-1, 7, 18], 1, Concat, [1]] # cat backbone P4 # 23
  - [-1, 3, C2f, [512]] # 24

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [[-1, 5, 16], 1, Concat, [1]] # cat backbone P3 # 26
  - [-1, 3, C2f, [256]] # 27

  - [-1, 1, Conv, [256, 3, 2]] # 28
  - [[-1, 24], 1, Concat, [1]] # cat head P3 # 29
  - [-1, 3, C2f, [512]] # 30

  - [-1, 1, Conv, [512, 3, 2]] # 31
  - [[-1, 10, 21], 1, Concat, [1]] # cat head P4 # 32
  - [-1, 3, C2f, [1024]] # 33

  # - [[27,16], 1, Concat, [1]]  # 34
  # - [[30,18], 1, Concat, [1]]  # 35
  # - [[33,21], 1, Concat, [1]]  # 36

  # - [[34,35,36], 1, Detect, [nc]] # Detect(P3, P4, P5)
  - [[27,30,33], 1, Detect, [nc]] # Detect(P3, P4, P5)